gotland_map = """...........................................................................................................................................................................................................................................ÑÑÑ........ÑÑÑ.......................
........................................................................................................................................................................................................................................ÑÑÑÑÑÑ....ÑÑÑÑÑÑÑ.......................
......................................................................................................................................................................................................................................ÑÑÑÑÑÑÑ.....ÑÑÑ...........................
.....................................................................................................................................................................................................................................ÑÑÑÑÑÑÑÑ...ÑÑÑÑÑ................ÑÑÑÑÑÑ.....
............................................................................................................................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........ÑÑÑÑÑÑÑÑÑÑÑÑ..
.........................................................................................................................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..
.......................................................................................................................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.
......................................................................................................................................................................................................................ÑÑÑÑÑÑ$$$ÑÑ...$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ
.....................................................................................................................................................................................................................ÑÑÑÑÑÑ$$$$ÑÑ....OO$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ
.....................................................................................................................................................................................................................ÑÑÑÑÑ$$$ÑÑÑÑÑ....$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....
.........................................................................................................................................................................................................................$$$ÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑ.....ÑÑÑÑÑÑÑÑÑ........
........................................................................................................................................................................................................................$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$............ÑÑÑÑÑ.........
.......................................................................................................................................................................................................................$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$..........................
....................................................................................................................................................................................................................$$.$$$$$$$$$$$$$$$$$$$$$$$$$................................
.........................................................................................................................................ÑÑ........................................................................$$$$$ÑÑÑÑÑÑÑ$$$$$$$$$....$$$.................................
.....................................................................................................................................ÑÑÑÑÑÑÑÑÑ......................⁕⁕⁕⁕⁕⁕⁕⁕ÑÑÑ⁕⁕⁕⁕⁕⁕⁕.........................⁕..$$$$ÑÑÑÑÑÑÑÑÑ$$$$$$$$.........................................
..................................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............ÑÑÑ......⁕$$$$$$$ÑÑÑÑÑÑÑ$$$$$$$............................................
................................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....⁕$$$$$$$$$ÑÑÑÑÑ$$$$$$.............................................
..............................................................................................................................ÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑ................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...⁕$$$$$$$$$$ÑÑÑÑ$$$ÑÑÑÑ.............................................
............................................................................................................................ÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑ..............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..$$$$$$$$$Ñ$$$$$$$$$ÑÑÑÑÑÑ...........................................
.........................................................................................................................ÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑ..............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....O$$$$ÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑ.........................................
......................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑ..............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........ÑÑÑÑÑÑÑÑÑ...ÑÑÑÑ.......$$$$$ÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑ........................................
....................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑ................ÑÑÑÑÑÑÑÑÑÑÑÑÑ..........ÑÑÑÑÑÑÑÑ....ÑÑÑÑ..........$$ÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑ$.......................................
...................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑ...............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...ÑÑÑÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑ............ÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑ$$.......................................
...................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........ÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑ.........................................
..................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........ÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑ...........................................
..................................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........ÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑ...........................................
..................................................................................................................ÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑ.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$......ÑÑÑÑÑÑÑÑ..ÑÑÑ.............................................
..................................................................................................................ÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑ......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$......ÑÑÑÑÑÑÑÑÑÑÑ.............................................
.................................................................................................................ÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$......ÑÑÑÑÑÑÑÑ...............................................
.................................................................................................................ÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....ÑÑÑÑÑÑÑ...............................................
...............................................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑ....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......ÑÑ................................................
.................................................................................................ÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......Ñ.................................................
...............................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................
......................................................................................ÑÑÑ....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....ÑÑÑÑÑÑÑÑÑ.......................................................
...................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............ÑÑÑÑ.......................................................
................................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............ÑÑÑÑ.......................................................
..............................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............ÑÑÑ.......................................................
.............................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ........................................................................
.............................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ........................................................................
............................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........................................................................
..........................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑ.ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........................................................................
.........................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑ....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............................................................................
.........................................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑ.......ÑÑÑÑÑÑÑÑÑÑÑÑ....$$........................................................................
........................................................................ÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......ÑÑÑÑ...ÑÑÑÑÑÑÑÑÑÑ$$$$......................................................................
.......................................................................ÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ....ÑÑÑÑÑÑÑÑ$$$$......................................................................
......................................................................ÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....ÑÑ...$$$$$$$$....................................................................
......................................................................ÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........$$$$$$$....................................................................
.....................................................................ÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........$$$$$$.....................................................................
.....................................................................ÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ............$$........................................................................
....................................................................ÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ............$$........................................................................
...................................................................ÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ............$$........................................................................
..................................................................ÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................
..................................................................ÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................
................................................................ÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......ÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................
...............................................................ÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ........ÑÑÑÑÑÑ....ÑÑÑÑÑÑ.....ÑÑÑÑ.....................................................................................
..............................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........$$ÑÑÑ.....ÑÑÑÑ...............................................................................................
.............................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..OOOÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$........$$.........ÑÑÑÑ...............................................................................................
............................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...$$$$$......$$$$...........................................................................................................
...........................................................ÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$.......$$$...........................................................................................................
..........................................................ÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$.......$$$...........................................................................................................
.........................................................ÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$.......................................................................................................................
........................................................ÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
.......................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................................................
......................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................
......................................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................................................
....................................................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
...................................................⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
..................................................⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ........................................................................................................................
................................................⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................
..............................................⁕⁕⁕OOOOÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................
.............................................⁕⁕⁕OOOOOÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........................................................................................................................
...........................................⁕⁕ÑÑÑOOOOÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................
.........................................⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................
........................................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................
.......................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................
......................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............................................................................................................................
....................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............................................................................................................................
.................................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................
..............................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................
............................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
.......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................
.....................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................................................
..................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
...............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
.............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................
............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................................................
...........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................
..........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ....................................................................................................................
........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ....................................................................................................................
........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................................................
......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................................................
....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ........................................................................................................................
...ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................
...ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........................................................................................................................
...ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................
...ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...............................................................................................................................
....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...............................................................................................................................
....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ................................................................................................................................
....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...............................................................................................................................
....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............................................................................................................................
.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑOOOÑÑ.............................................................................................................................
.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑOOOÑÑÑÑÑ..........................................................................................................................
.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................
.......ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................
.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................
.......ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................
......$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................
.......$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................
.......$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ........................................................................................................................
......$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......................................................................................................................
......$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............$$$$...................................................................................................
.......$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....$$$$$$..................................................................................................
...........$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$.................................................................................................
............$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$................................................................................................
............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$..............................................................................................
............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑ...ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$............................................................................................
............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑÑ..ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$............................................................................................
.............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$............................................................................................
................$$ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$.............................................................................................
................$$$$$ÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$...............................................................................................
................$$$$$$$ÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑ$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ......$$$$..................................................................................................
.....................$$$ÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......$$$...................................................................................................
.....................$$$ÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............................................................................................................
..................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...................................................................................................................
.................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................
.................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................
.................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ................................................................................................................................
..................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..................................................................................................................................
.................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...................................................................................................................................
.................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ....................................................................................................................................
..................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................................
.................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑ........................................................................................................................................
.................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................................
.................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................................
................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$ÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................................
................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...............................................................................................................................................
..............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$ÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑ................................................................................................................................................
............ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$ÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑ..................................................................................................................................................
..........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$ÑÑÑÑÑÑÑÑ...................................................................................................................................................
........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$ÑÑ$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ....................................................................................................................................................
....⁕⁕⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑ$ÑÑÑÑÑÑÑÑÑÑÑ....................................................................................................................................................
..⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑ$$$$$$$$ÑÑÑÑÑÑÑÑÑ...................................................................................................................................................
.⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$Ñ$$$$$$$$$$$$$$ÑÑ$$$$$$$$.................................................................................................................................................
.ÑÑÑÑÑÑÑOOÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$ÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$...............................................................................................................................................
⁕ÑÑÑÑÑÑÑOOÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑ..........................................................................................................................................
⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$OO$$$$ÑÑÑÑÑÑÑÑÑ.........................................................................................................................................
⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$...$$$ÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................................
⁕⁕⁕⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$..$$$ÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................................
...⁕⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑ..ÑÑÑÑ..........................................................................................................................................
......⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................................
.......⁕⁕⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑ..ÑÑÑ..........................................................................................................................................
...........⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑ.................................................................................................................................................
............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ............................................................................................................................................
............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$$$$$$$ÑÑÑÑÑÑ..ÑÑÑÑÑÑ............................................................................................................................................
............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$$$ÑÑÑÑÑ....ÑÑÑÑ.............................................................................................................................................
.............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$........ÑÑ......ÑÑ...............................................................................................................................................
.............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................................................................
.............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........................................................................................................................................................................
.............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ....Ñ.......................................................................................................................................................................
............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................................................................
............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................................................................
.............⁕⁕⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...............................................................................................................................................................................
................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...................................................................................................................................................................................
.............⁕⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................................................................................
..............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.........................................................................................................................................................................................
............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................................................................................
............⁕⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...........................................................................................................................................................................................
...............⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..................................................................................................................................................................................................
................⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...................................................................................................................................................................................................
................⁕ÑÑÑ⁕⁕ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................................................................................................
................⁕⁕⁕⁕...⁕$$ÑÑÑÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..........................................................................................................................................................................................................
........................⁕$ÑÑÑÑÑÑÑÑÑÑ$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................................................................................................
........................⁕⁕⁕ÑÑÑÑÑÑÑÑ$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................................................................................................
...........................⁕$$$$Ñ$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..............Ñ...............................................................................................................................................................................................
.........................⁕$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.ÑÑÑÑÑÑÑÑÑÑÑÑÑ...............................................................................................................................................................................................
.........................⁕$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.................................................................................................................................................................................................
..........................⁕$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...................................................................................................................................................................................................
..........................⁕$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..ÑÑÑ......................................................................................................................................................................................................
...........................⁕$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................................................................................................
..........................⁕$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..................................................................................................................................................................................................................
.........................⁕$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ...................................................................................................................................................................................................................
.........................⁕$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ....................................................................................................................................................................................................................
.........................⁕$$ÑÑÑÑÑÑÑÑÑÑ....ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................................................................................................................
........................⁕$$$$ÑÑÑÑÑÑ........ÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.......................................................................................................................................................................................................................
.......................$$$$$$$$ÑÑÑÑ.........ÑÑÑÑÑÑÑÑÑÑÑÑ........................................................................................................................................................................................................................
.......................$$$$$$$$$$...........ÑÑÑÑÑÑÑÑÑ$..........................................................................................................................................................................................................................
........................$$$$$$$............ÑÑÑÑÑÑÑÑÑ$$..........................................................................................................................................................................................................................
...........................................ÑÑÑÑÑÑÑÑ$$$$$$.......................................................................................................................................................................................................................
...........................................ÑÑÑÑÑÑÑÑ$$$$$........................................................................................................................................................................................................................
..........................................ÑÑÑÑÑÑÑÑÑ$$$$.........................................................................................................................................................................................................................
.........................................ÑÑÑÑÑÑÑÑÑÑ$$$$$........................................................................................................................................................................................................................
.......................................ÑÑÑÑÑÑÑÑÑÑÑ$$$$$.........................................................................................................................................................................................................................
.............................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$.........................................................................................................................................................................................................................
..........................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$..........................................................................................................................................................................................................................
.......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$..........................................................................................................................................................................................................................
.......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$.........................................................................................................................................................................................................................
......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$........................................................................................................................................................................................................................
.......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$$$$$.................................................................................................................................................................................................................
........................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$OO$$$$...............................................................................................................................................................................................................
......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$OOO$$$...............................................................................................................................................................................................................
......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$......................................................................................................................................................................................................................
.......................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$.....................................................................................................................................................................................................................
.....................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$......................................................................................................................................................................................................................
...................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$.........................................................................................................................................................................................................................
..................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$..........................................................................................................................................................................................................................
.................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$.............................................................................................................................................................................................................................
................ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$..............................................................................................................................................................................................................................
...............$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$$..............................................................................................................................................................................................................................
..............$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ$$$$$$$$...............................................................................................................................................................................................................................
.............$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.................................................................................................................................................................................................................................
............$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ................................................................................................................................................................................................................................
...........$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ..................................................................................................................................................................................................................................
..........$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑÑ.....................................................................................................................................................................................................................................
.........$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑÑÑÑ.............................................................................................................................................................................................................................................
.........$$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑ................................................................................................................................................................................................................................................
........$$$$$$$$$$$$$ÑÑÑÑÑÑÑÑÑ..................................................................................................................................................................................................................................................
............$$$.....ÑÑÑÑÑÑ......................................................................................................................................................................................................................................................
....................ÑÑÑ.........................................................................................................................................................................................................................................................
"""

village_0_map = """ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╔══════════════════════╗▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╚══════════━━══════════╝▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅▒▒██▒▒┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""

village_1_map = """ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╔══════════════════════╗▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╚══════════━━══════════╝▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅▒▒██▒▒┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""

village_2_map = """ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╔══════════════════════╗▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╚══════════━━══════════╝▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅▒▒██▒▒┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""

village_3_map = """ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╔══════════════════════╗▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╚══════════━━══════════╝▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅▒▒██▒▒┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""

village_4_map = """ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╔══════════════════════╗▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╚══════════━━══════════╝▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅▒▒██▒▒┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██████████████████████████████████████████████████▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""

village_5_map = """ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╔══════════════════════╗▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╚══════════━━══════════╝▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅▒▒██▒▒┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╔═══════╗▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓┃████████████████┃▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒██▒▒┋▒▒▒▒║▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒██▒▒┋▒▒▒▒╚═══════╝▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒██▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒██▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""

village_6_map = """ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╔══════════════════════╗▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒║▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓║▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒╚══════════━━══════════╝▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒┋┅┅┅┅┅┅┅┅┅┅┅┅┅▒▒██▒▒┅┅┅┅┅┅┅┅┅┅┅┅┅┋▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
Æ▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒██▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒▒Æ
ÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆÆ
"""

odin_face = """                                               __ _   ________________.______________...............,,,,,,,---,,..,,--=+++:::::;;;
                                            ____________________........______..___................,,,,,,,,----,,.,-===+:::;;::;;;
                             __  ___    ______________________.._____.___....._._................,,,,,,,,,----------==++:;;;;;cccc
                             _______________________________..__________......_...............,,,,,,,,-,,,-,-------==+++;;;;;;;;cc
                     __ _________________________________...,,,,,,-,--,,......................,,,,,,,,,,,,,====-====+++:;;;;;:;;;;
                      ____________________________.....,,==+++++:;ccbb;:c;:+-.................,,,,,,,,,,,,,-----=======++:+:;;:+::
              _____________________..____________..,---===+;;;cb!ba!?0010aaabbc;;:+=-,.........,,,,,,,,,,-------=====++++++++++=++
             ________________________________...,,--=++:::cbaba!??0265210101?!a;::++-,....,,.,,,,,,,,,,------========+++++======++
             ______________________________..,,--==+++;cca?3101?125876555776433211110a;=...,,,,,,,,,,,,,,,---=========++++=====-=-
            ____________________________......,,--=+:;;a2?0553432576258887757877554220b:-.,,,,,,,,,,---,,,-------==---=+++=====---
         _______________________________.........,-=:cb01324633133556665445531?b;;++cabc:-,,,,,,,,,,,----------,-------====--==---
         _________________________________......,-=+++:c!221112004433245551?!!??00?c;c0!;=,,,,,,,,,,,,------==---====-------------
             ____________________________.....,,--+::++++b!?0????3323434?cb!0?aa!162a!013!-,,,,,,,,,,,,----====-=====---,,-,,-----
          ______________________________.....,,,-=:;caaccc+a?2?!?221101c;cb?a?aab!454?2426?=.,,,,,,,,,,,,,------------------------
         ______________________________.....,,,-=+cbba?!b;acbc!?!1?aa;0bbcca230?!0335426666!-,,,,,,,,,,,,,,,,,----------,-----,,,,
         ___________________________._.....,,,,=+;ca12?;:??b0!0122221c13?1;cc560004553467793;,.,,,,,,,,,,,,,,,-,,,-----,,,,,,,,,,,
         ___________________________......,,,.-=:cc120c;a0?a1123455674654611b?460?5576668899;=,,,,,,,,,,,,,,,,,,,,,---,,,,,,,,,,,,
          __________________________.....,,,.-==;a01acccb!0a1234456678764655!?255!28687899994-,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,,
__         __________________________...,...,==+b?1!c:;;cca?0123345566655776?b018307676858697?,,,,,,,..,,,,,,,,,,,,,,,,,,,,,,,,,,,
_           ________________________.,.,....-=+;b2!;;+::;cca?0122344444678641!?a77063538460874+,,,,,......,,,,,,,,,,,,............
    ___    ________________________.....,..,-=+c!1b::+:ca!?012202222355662?010!!57261456540693c,,,,.............,.................
     ______________________________...,,,,,=-+;ca?:---=:b!2233102?021?ac:--=+:c!462603754?2692a,,.............................____
    ______________________________....,,,,-==+bcb!:,.,-,---=:::cc;+--,...,---+ca252203643a1554-=,,............................____
   _______________________________......,-=++:bbba:,,====-==---+bc:-,,..,--=+;cb!43203332ba526;-...,,,.......................__...
    ______________________________.....,-==+++cc!?+--==+:;;::==:a01!c:+===+:;abca331?241?b2134!;..................................
   _______________________________..,,.,-=+==+;c!a;++:cb!?!ab;::a2630110???!0240!110a23!b!4315:=,,.,=-,.--,-,.....-...............
 ________________________________...,,,,-==+-c:a0a:+:;b!0001!c::a150!?3556625885;!a2a120?a0466;..+:+=-+++-=:bca;acc++=-...........
 _______________________________.....,,--====c+a0a+-=::a!!1?:+;;b2212aa26676263b+b=022011123751=::;+cc!!cc!??!01022?ab;=-:+-._____
 ______________________________._..,.,,=-=:==;:!?b+-==+;bb;+;+--=+=-+b22264210?!c+cc!4221436687:=;ccba0!!00!0354432100?0330ac+,___
_______________________ _______.__.,,,,-=-:=+:;!a+:===++:;b?11!:+=;c1257621??!351c:b;b344565776a+::b?!aaacb!b?12233233210110a;+_
_____________________________..___.,,,,-=-+=;:a!+--=+=+;b?0??!ccb!1!a!?1676111432?;:;+16744565!:-:cbcb!bccbba?!!021222210?abbc=,
   ___________________________.__..,,,,-===-b:ab-,-+==:c!0?b;;;cba!!ab;+;?463114231+:+263?2552b+::;ccc;;bbcb????!!011120?!0120cb:,
   ___________________________.._...,,---===;;cb-,-+++;!1a;cac;++=+:;a!?cc?56523343:+:64?!244!--++++::;ccb!?0??023331110!????000b,
   ____________________________.....,,-,---=;b;!;-=+++a??;+;cacc++;ba!22?;b0765263?a=06?a2123b-===++:::;caaa!013212321100?00a??ab:
________________________________.....,-,-,=+c;;!;==+=cb?a+=+;cbcaca12201;:b?787452a:!50!10023:,==++++++cc;cca0?????12211000??!?10!
____________________________.____.,...----,:;:ba+==+=ba!b-===+:?0?!144?b:=cc466652cc42a?1?b30:,===++=+:::::b0111001110???000???000
_______________......__........___,,..,-,=-+b+aa--=++c?ab+::::c30??1332??;;c223643:!50a?1102a;---=+++:;;::c!b!a?354300?0??!abccccc
____________................,,,....,,..----=:;b+,,==+c!;+;:::;14212234131?:c203552;!40?aa111!c,--===+++++:bc;b??04432110!aaac;;;;:
_______..............,,,,---.-,,....--,,-=,-=cc-,,-=+c0+++=++;!1??21342141;:?13332;a200!b01?bb,,---====+++++;bba!?12120?01?ab;:;:;
___............,+;;++====-----==-,..,=-,,--+:;a,.,,=:b?-:===+:b0bb01145354+cba3140bc323?a121:a,-,----=+=+===+::cbb!!!010020!ab;::+
_.............,+b:++++==--+-+-=+:=-,.,=-,--+::c,..,-+!?===+=++;1a!10?65656c!;a15?0b=a321?2?a;b-,,,,,-=--==-+:::::cbccb!00a:;cc;;:+
..__..,.,,,-=+++==---==+++++++=:+:=-,.-=,,,=;+:,.,.,:c;=-=+=+::a?1213655550?=+c?ca!,,a4212?+,+-,,,,,=--=--=+-=:;:+:bbcb;:cabcc+===
.....,,--==-----===c?!b;;;:;:++:;::=-.,+-,-=c=+..,..-++,--==+:+bab112464533c--;2c+;=.-3331a-,.,---.-=-=--=+-=++==++=--==+cccbb:+==
,.,,,,,,,,-==+++-=b!b;;:::=+;:;:;:;=-,.+=-,+;-;,....,-+,-,---:;cbb014244443a--c3=-=-.,3422;-,,..,..,,.-,--=-,=----====--::c;+==---
,,-+===-,-=++c;;;;:++-c0?b;:c:;:c;c+=,.++-,+=-b,,...,-=,,-,-=+caca!03035345!--:1+=--.+544?;-.,.....,,,,,,,---,-,,---,-==::=====+::
-==+:+;:+=++++=--=+bc;!abb:;c;::c;:::,.++,,=--:,,...,-=,,,,,-++b??!11334653+,,:1;:+=.b42a2+-........,,,,,,,.,,,,--,---===--+:;b;==
--===++:+;::==-==+:;::::::;;;;;;;;:+=,,==,-=+=,=-....-=,-,,,,=+:aa!0033563;-,,+0+:=--00ab3:,,......,,.,,,,,,,,,,,-----=:cccbb;=;!b
----=++=++::+:++++:::::;:;;:::::++=--.,-=-==+-,,:,...,=,.,,,,,+c:ab!02432a;:,,=!++=,:1cba?c,,..........,,,,,,,,,,,-=:cbcbaa:=+?420
,,--=++:++=+++++=:+++++++++++;+-----,.,-=-+=:,..,-...,-....,,--;+aca!0??ccc=.-;ab+,,:0+bba;+,,,,..,,,,,,,,,,,-=+:;;;;cbbc+--=1002!
,,,-==::++++++=++++====+++:aa:-,,,,,.,--=+=;+..,....,-:=,,....,=;;:b!!b;c;+,-c?24:===b=cb:::+,,,---,,,,,---=++:::::;;:=-cb+=:aa??!
-,,,=====++=============,-:06b-,,,,,---.=;=bc+-,,...+;1?--,....,=;c??!!cb;--+c035!:aa0c+c==,=,,,,,--========++;;:+-,,:c+?a=+;!a??!
---,,,---=====-=-------,.-=-,-,,,,,=+-,.-;+:::;c;:=-::11--,.....=ca100?;;+.,;b22650ac;ccc-+-,,,,..,,,,,,,-----,,,,,=;16ba==;;cc!0c
..,,---,,,----,-,,,,,,,,,.,=-,,,-=+=,,.,-:;:++++=++=::10==-,.,,-=;c?!!ab0a==c?343;ccc;:+;=c=,,.,,,--,.,,,-=,,,,-:1:-=;a;-,=+:;;0aa
.....,-===-,,,,,,,,,,,,,,,,,-===-,.,:a=.-=;c+=++:+-,=+!!+:cc=-:c;0?0345552c;!a331?c;++:+,=a+,,=,,,---=--=+=,=;--+!?=-++0:-=++:bab?
.........,--====+++++:::::+==-,...-a242:,=-::--=+:+-=:ca++=,,-++c121346300c+a123!ccc:+:=.-bb,,--=,,,==;=,,-+c12+=:+!1cc!--+++:cca!
..,.,=+c=.....,,,,,-,,,,,....,,,,,:a132?b-,::=--+:+--;bb:+--,-=:b02554632a;?5211c;;+=::-.-a;:---,--,--------:b!:--:!41+,,--+==:::b
.,,,+++-....,._________.._..,::+-,--==,-==,=:+,--=+==c;c+=,,-=-:b2534452?cc362?!bc:=+:+-.-b;,,.,,-:=,,,-=;c-+;=+10+c0a:,---===:;bc
,,,,....-,.,,,_........_...,,,:;;=-..,=+cc---+,,--=+=:====--,==;;1134430c;a34??b;;==::=..-cb,,-.,--,--,,=:c=,,=;!!==+0;,-,===+:;;c
..,-...,++=..._.__...._.....,,.==..,-=+::;a=,,,,,---=+:++==+,=-;aa233443c!574!cc;c=+;;-..-;a,-=-,.,-=++-,=--:a;=+:0?:+,,-,-===:::c
,.-,,,.c?b:c=._._..__...,,.........-==;+:::ac-,,,,-++=+:++++-=-=cb2322??0169863?b:+:;=,..,:b,,--,-,,-=++,,-+ca:+=+:b;+,,,,,=++:c;b
.,-,,.=4?;:0+-.__...__...,,...,,..._,=++;++;c!:,,,--+::;;::+,,==;a01230a!1565520b+:;+-,..,+;,,,,,-==,-,-=:-=+=+cb=:+a+.,,,,=+::::;
----,.!4bcab,+,.____..........._..,._.=++:+::+bb-,,-=+::+==-,--;!!21?0aca264!???b+c:+=-..,=;.,,,,,-=-,,-=::-,=+c;c3a=.,-,,--=:::;+
=----=?b+=;-,==..___...,....,,.....,._.,++++++=+b;,.,-===+--==:cb14352bc?00?c;b:c!?c==-,.,-+,,--,,,,,=:-==-=+-,-+;aa?,,-,--+=++:c:
+++-,,,--=?+;+,_.____....,............._,===-----;c,,,-::=-==,-=b5556!cb4840b;c=:bbac=-,.,-+,,,,-,,---++.,=,=:,,+::ca,,-,,,===+++=
"""

odin = """    _____
   / ___ \ 
  / /   \ \ 
  || - o ||      ⮝
  ||  v  ||      █
  ||//_\\\\||      ║
  \ \\\\v// /      ║
 __/ \\v/ \__    _║
/     v     \  / ║3
| |   |   |\ \/ /║
| |   |   | \--/ ║
| |   |   |      ║
|_|   |   |      ║
((|   |   |      ║
  |   |   |      ║
  |   |   |      ║
  |   |   |      ║
  |   |   |      ║
  |___|___|      ║
"""

drakkar = """                                   ||`-.___
                                   ||    _.>
                                   ||_.-'
               ==========================================
                `.:::::::.       `:::::::.       `:::::::.
                  \:::::::.        :::::::.        :::::::\
                   L:::::::         :::::::         :::::::L
                   J::::::::        ::::::::        :::::::J
                    F:::::::        ::::::::        ::::::::L
                    |:::::::        ::::::::        ::::::::|
                    |:::::::        ::::::::        ::::::::|     .---.
                    |:::::::        ::::::::        ::::::::|    /(@  o`.
                    |:::::::        ::::::::        ::::::::|   |    /^^^
     __             |:::::::        ::::::::        ::::::::|    \ . \\vvv
   .'_ \            |:::::::        ::::::::        ::::::::|     \ `--'
   (( ) |           |:::::::        ::::::::        ::::::::|      \ `.
    `/ /            |:::::::        ::::::::        ::::::::|       L  \
    / /             |:::::::        ::::::::        ::::::::|       |   \
   J J              |:::::::        ::::::::        ::::::::|       |    L
   | |              |:::::::        ::::::::        ::::::::|       |    |
   | |              |:::::::        ::::::::        ::::::::|       F    |
   | J\             F:::::::        ::::::::        ::::::::F      /     |
   |  L\           J::::::::       .::::::::       .:::::::J      /      F
   J  J `.     .   F:::::::        ::::::::        ::::::::F    .'      J
    L  \  `.  //  /:::::::'      .::::::::'      .::::::::/   .'        F
    J   `.  `//_..---.   .---.   .---.   .---.   .---.   <---<         J
     L    `-//_=/  _  \=/  _  \=/  _  \=/  _  \=/  _  \=/  _  \       /
     J     /|  |  (_)  |  (_)  |  (_)  |  (_)  |  (_)  |  (_)  |     /
      \   / |   \     //\     //\     //\     //\     //\     /    .'
       \ / /     `---//  `---//  `---//  `---//  `---//  `---'   .'
________/_/_________//______//______//______//______//_________.'_________
##########################################################################
"""


main_logo = """
                  █▒▒ ▒▒   █▒▒                  █▒▒
                █▒▒    █▒▒ █▒▒                  █▒▒
                 █▒▒       █▒▒  █▒▒    █▒▒      █▒▒
                   █▒▒     █▒▒ █▒▒   █▒▒  █▒▒   █▒▒
                      █▒▒  █▒█▒▒    █▒▒   █▒▒   █▒▒
                █▒▒    █▒▒ █▒▒ █▒▒  █▒▒   █▒▒   █▒▒
                  █▒▒ ▒▒   █▒▒  █▒▒   █▒▒ █▒▒▒ █▒▒▒
"""

commands_logo = """
  █▒▒   █▒▒                                                      █▒▒          
  █▒▒  █▒▒                                                       █▒▒          
  █▒▒ █▒▒        █▒▒     █▒▒▒ █▒▒ █▒▒     █▒▒     █▒▒ █▒▒        █▒▒ █▒▒   █▒▒
  █▒ █▒        █▒▒  █▒▒   █▒▒  █▒  █▒▒  █▒   █▒▒   █▒▒  █▒▒  █▒▒ █▒▒   █▒▒▒▒▒ 
  █▒▒  █▒▒    █▒▒    █▒▒  █▒▒  █▒  █▒▒ █▒▒▒▒▒ █▒▒  █▒▒  █▒▒ █▒   █▒▒     █▒▒  
  █▒▒   █▒▒    █▒▒  █▒▒   █▒▒  █▒  █▒▒ █▒          █▒▒  █▒▒ █▒   █▒▒    █▒▒   
  █▒▒     █▒▒    █▒▒     █▒▒▒  █▒  █▒▒   █▒▒▒▒    █▒▒▒  █▒▒  █▒▒ █▒▒ █▒▒▒▒    
"""

save_logo = """
                      █▒▒▒▒▒▒▒ █▒▒                                          
                             █▒▒                        █▒                  
                            █▒▒       █▒▒     █▒ █▒▒        █▒▒▒▒  █▒▒   █▒▒
                          █▒▒       █▒▒  █▒▒  █▒  █▒▒  █▒▒ █▒▒       █▒▒▒▒▒ 
                         █▒▒       █▒▒   █▒▒  █▒█▒▒    █▒▒   █▒▒▒      █▒▒  
                       █▒▒         █▒▒   █▒▒  █▒▒      █▒▒     █▒▒    █▒▒   
                      █▒▒▒▒▒▒▒▒▒▒▒   █▒▒ █▒▒▒ █▒▒      █▒▒ █▒▒ █▒▒ █▒▒▒▒    
      """